7767517
193 215
Input            input.1                  0 1 input.1
Convolution      Conv_0                   1 1 input.1 797 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             Relu_1                   1 1 797 447
Pooling          MaxPool_2                1 1 447 448 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 448 448_splitncnn_0 448_splitncnn_1
ConvolutionDepthWise Conv_3                   1 1 448_splitncnn_1 800 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_4                   1 1 800 803 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_5                   1 1 803 453
Convolution      Conv_6                   1 1 448_splitncnn_0 806 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_7                   1 1 806 456
ConvolutionDepthWise Conv_8                   1 1 456 809 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_9                   1 1 809 812 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_10                  1 1 812 461
Concat           Concat_11                2 1 453 461 462 0=0
ShuffleChannel   Reshape_16               1 1 462 467 0=2 1=1
Slice            Gather_20                1 2 467 469 471 -23300=2,-233,-233 1=0
Convolution      Conv_21                  1 1 471 815 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_22                  1 1 815 474
ConvolutionDepthWise Conv_23                  1 1 474 818 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_24                  1 1 818 821 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_25                  1 1 821 479
Concat           Concat_26                2 1 469 479 480 0=0
ShuffleChannel   Reshape_31               1 1 480 485 0=2 1=1
Slice            Gather_35                1 2 485 487 489 -23300=2,-233,-233 1=0
Convolution      Conv_36                  1 1 489 824 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_37                  1 1 824 492
ConvolutionDepthWise Conv_38                  1 1 492 827 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_39                  1 1 827 830 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_40                  1 1 830 497
Concat           Concat_41                2 1 487 497 498 0=0
ShuffleChannel   Reshape_46               1 1 498 503 0=2 1=1
Slice            Gather_50                1 2 503 505 507 -23300=2,-233,-233 1=0
Convolution      Conv_51                  1 1 507 833 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_52                  1 1 833 510
ConvolutionDepthWise Conv_53                  1 1 510 836 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_54                  1 1 836 839 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_55                  1 1 839 515
Concat           Concat_56                2 1 505 515 516 0=0
Split            splitncnn_1              1 2 516 516_splitncnn_0 516_splitncnn_1
ConvolutionDepthWise Conv_57                  1 1 516_splitncnn_1 842 0=48 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_58                  1 1 842 845 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_59                  1 1 845 521
Convolution      Conv_60                  1 1 516_splitncnn_0 848 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_61                  1 1 848 524
ConvolutionDepthWise Conv_62                  1 1 524 851 0=48 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_63                  1 1 851 854 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_64                  1 1 854 529
Concat           Concat_65                2 1 521 529 530 0=0
ShuffleChannel   Reshape_70               1 1 530 535 0=2 1=1
Slice            Gather_74                1 2 535 537 539 -23300=2,-233,-233 1=0
Convolution      Conv_75                  1 1 539 857 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_76                  1 1 857 542
ConvolutionDepthWise Conv_77                  1 1 542 860 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_78                  1 1 860 863 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_79                  1 1 863 547
Concat           Concat_80                2 1 537 547 548 0=0
ShuffleChannel   Reshape_85               1 1 548 553 0=2 1=1
Slice            Gather_89                1 2 553 555 557 -23300=2,-233,-233 1=0
Convolution      Conv_90                  1 1 557 866 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_91                  1 1 866 560
ConvolutionDepthWise Conv_92                  1 1 560 869 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_93                  1 1 869 872 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_94                  1 1 872 565
Concat           Concat_95                2 1 555 565 566 0=0
ShuffleChannel   Reshape_100              1 1 566 571 0=2 1=1
Slice            Gather_104               1 2 571 573 575 -23300=2,-233,-233 1=0
Convolution      Conv_105                 1 1 575 875 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_106                 1 1 875 578
ConvolutionDepthWise Conv_107                 1 1 578 878 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_108                 1 1 878 881 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_109                 1 1 881 583
Concat           Concat_110               2 1 573 583 584 0=0
ShuffleChannel   Reshape_115              1 1 584 589 0=2 1=1
Slice            Gather_119               1 2 589 591 593 -23300=2,-233,-233 1=0
Convolution      Conv_120                 1 1 593 884 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_121                 1 1 884 596
ConvolutionDepthWise Conv_122                 1 1 596 887 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_123                 1 1 887 890 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_124                 1 1 890 601
Concat           Concat_125               2 1 591 601 602 0=0
ShuffleChannel   Reshape_130              1 1 602 607 0=2 1=1
Slice            Gather_134               1 2 607 609 611 -23300=2,-233,-233 1=0
Convolution      Conv_135                 1 1 611 893 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_136                 1 1 893 614
ConvolutionDepthWise Conv_137                 1 1 614 896 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_138                 1 1 896 899 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_139                 1 1 899 619
Concat           Concat_140               2 1 609 619 620 0=0
ShuffleChannel   Reshape_145              1 1 620 625 0=2 1=1
Slice            Gather_149               1 2 625 627 629 -23300=2,-233,-233 1=0
Convolution      Conv_150                 1 1 629 902 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_151                 1 1 902 632
ConvolutionDepthWise Conv_152                 1 1 632 905 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_153                 1 1 905 908 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_154                 1 1 908 637
Concat           Concat_155               2 1 627 637 638 0=0
ShuffleChannel   Reshape_160              1 1 638 643 0=2 1=1
Slice            Gather_164               1 2 643 645 647 -23300=2,-233,-233 1=0
Convolution      Conv_165                 1 1 647 911 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_166                 1 1 911 650
ConvolutionDepthWise Conv_167                 1 1 650 914 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_168                 1 1 914 917 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_169                 1 1 917 655
Concat           Concat_170               2 1 645 655 656 0=0
Split            splitncnn_2              1 3 656 656_splitncnn_0 656_splitncnn_1 656_splitncnn_2
ConvolutionDepthWise Conv_171                 1 1 656_splitncnn_2 920 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_172                 1 1 920 923 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_173                 1 1 923 661
Convolution      Conv_174                 1 1 656_splitncnn_1 926 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_175                 1 1 926 664
ConvolutionDepthWise Conv_176                 1 1 664 929 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_177                 1 1 929 932 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_178                 1 1 932 669
Concat           Concat_179               2 1 661 669 670 0=0
ShuffleChannel   Reshape_184              1 1 670 675 0=2 1=1
Slice            Gather_188               1 2 675 677 679 -23300=2,-233,-233 1=0
Convolution      Conv_189                 1 1 679 935 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_190                 1 1 935 682
ConvolutionDepthWise Conv_191                 1 1 682 938 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_192                 1 1 938 941 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_193                 1 1 941 687
Concat           Concat_194               2 1 677 687 688 0=0
ShuffleChannel   Reshape_199              1 1 688 693 0=2 1=1
Slice            Gather_203               1 2 693 695 697 -23300=2,-233,-233 1=0
Convolution      Conv_204                 1 1 697 944 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_205                 1 1 944 700
ConvolutionDepthWise Conv_206                 1 1 700 947 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_207                 1 1 947 950 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_208                 1 1 950 705
Concat           Concat_209               2 1 695 705 706 0=0
ShuffleChannel   Reshape_214              1 1 706 711 0=2 1=1
Slice            Gather_218               1 2 711 713 715 -23300=2,-233,-233 1=0
Convolution      Conv_219                 1 1 715 953 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_220                 1 1 953 718
ConvolutionDepthWise Conv_221                 1 1 718 956 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_222                 1 1 956 959 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_223                 1 1 959 723
Concat           Concat_224               2 1 713 723 724 0=0
Split            splitncnn_3              1 2 724 724_splitncnn_0 724_splitncnn_1
Convolution      Conv_225                 1 1 724_splitncnn_1 962 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13824
ReLU             Relu_226                 1 1 962 727
Split            splitncnn_4              1 2 727 727_splitncnn_0 727_splitncnn_1
ConvolutionDepthWise Conv_227                 1 1 727_splitncnn_1 965 0=72 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
ReLU             Relu_228                 1 1 965 730
Convolution      Conv_229                 1 1 730 968 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184
ConvolutionDepthWise Conv_230                 1 1 968 971 0=72 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
ReLU             Relu_231                 1 1 971 735
Convolution      Conv_232                 1 1 735 974 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184
Split            splitncnn_5              1 2 974 974_splitncnn_0 974_splitncnn_1
ConvolutionDepthWise Conv_233                 1 1 727_splitncnn_0 977 0=72 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
ReLU             Relu_234                 1 1 977 740
Convolution      Conv_235                 1 1 740 980 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184
ConvolutionDepthWise Conv_236                 1 1 980 983 0=72 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
ReLU             Relu_237                 1 1 983 745
Convolution      Conv_238                 1 1 745 986 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184
Interp           Resize_240               1 1 724_splitncnn_0 752 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_241               2 1 752 656_splitncnn_0 753 0=0
Convolution      Conv_242                 1 1 753 989 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20736
ReLU             Relu_243                 1 1 989 756
Split            splitncnn_6              1 2 756 756_splitncnn_0 756_splitncnn_1
ConvolutionDepthWise Conv_244                 1 1 756_splitncnn_1 992 0=72 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
ReLU             Relu_245                 1 1 992 759
Convolution      Conv_246                 1 1 759 995 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184
ConvolutionDepthWise Conv_247                 1 1 995 998 0=72 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
ReLU             Relu_248                 1 1 998 764
Convolution      Conv_249                 1 1 764 1001 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184
Split            splitncnn_7              1 2 1001 1001_splitncnn_0 1001_splitncnn_1
ConvolutionDepthWise Conv_250                 1 1 756_splitncnn_0 1004 0=72 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
ReLU             Relu_251                 1 1 1004 769
Convolution      Conv_252                 1 1 769 1007 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184
ConvolutionDepthWise Conv_253                 1 1 1007 1010 0=72 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
ReLU             Relu_254                 1 1 1010 774
Convolution      Conv_255                 1 1 774 1013 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184
Convolution      Conv_256                 1 1 1013 777 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=864
Sigmoid          Sigmoid_257              1 1 777 778
Convolution      Conv_258                 1 1 1001_splitncnn_1 779 0=3 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=216
Sigmoid          Sigmoid_259              1 1 779 780
Convolution      Conv_260                 1 1 1001_splitncnn_0 781 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
Permute          Transpose_261            1 1 781 782 0=5
Softmax          Softmax_262              1 1 782 783 0=2 1=1
Permute          Transpose_263            1 1 783 784 0=5
Convolution      Conv_264                 1 1 986 785 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=864
Sigmoid          Sigmoid_265              1 1 785 786
Convolution      Conv_266                 1 1 974_splitncnn_1 787 0=3 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=216
Sigmoid          Sigmoid_267              1 1 787 788
Convolution      Conv_268                 1 1 974_splitncnn_0 789 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
Permute          Transpose_269            1 1 789 790 0=5
Softmax          Softmax_270              1 1 790 791 0=2 1=1
Permute          Transpose_271            1 1 791 792 0=5
Concat           Concat_272               3 1 778 780 784 793 0=0
Permute          Transpose_273            1 1 793 794 0=3
Concat           Concat_274               3 1 786 788 792 795 0=0
Permute          Transpose_275            1 1 795 796 0=3
